package a_variable;
/*
 * 
 */
//주석: 프로그램 코드로 인식하지 않는 문장.(주로 코드를 설명하는데 사용한다.)
//프로그램 실행에 아무 영향 없음. 컨트롤 시프트 c 가 단축키임. 한줄주석.
/*범위 주석 : ctrl + shift + /(해제 : \)*/

//클래스(class) : 데이터와 처리내용의 집합.
//프로그램은 데이터와 그 데이터 처리인뎅.. 클래스도 마찬가지.

public class ABC {
	//{} : 블럭.(내용의 범위)클래스의 범위.
	
	//변수 : 데이터. 
	int variable;
	
	//메서드
	public static void main(String[] args) {
		//태앱한칸으로 계층 구분! 코드를 보기좋게 해주기위해서. 반드시해조야대
		//코드는 기본적으로 위에서 아래로, 왼쪽에서 오른쪽으로 실행된다.
		//실행할 문장을 메서드 안에 넣는다.
		System.out.println("Hello");// ln 은 라인.
		System.out.print("Hello");//얘는 줄바꿈을 하지 않는다.
		System.out.print("Hello");//얘는 줄바꿈을 하지 않는다.
		//괄호안에 있는 내용을 콘솔창에 출력하는 메서드다.
		//prinln 도 메서드다. 어딘가에 만들어져있는.
		//실행하면 콘솔창에 Hello가 실행될 것이다. 단축키 ctrl F11
		//main메서드의 마지막 문장까지 수행되면 프로그램은 종료된다.
		

	}

}

